Revit 2026 API

# ParameterSetErase Method

---

Removes a specified parameter from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	Parameter item
)
```
```vb
Public Overridable Function Erase (
	item As Parameter
) As Integer
```
```cpp
public:
virtual int Erase(
	Parameter^ item
)
```
```fsharp
abstract Erase :
        item : Parameter -> int
override Erase :
        item : Parameter -> int
```

#### Parameters

item Parameter
    The parameter to be erased.

#### Return Value

Int32The number of parameters that were erased from the set.

#### Reference

ParameterSet Class

Autodesk.Revit.DB Namespace